
&НаКлиенте
Процедура ОткрытьНастройки(ОписаниеОповещения = Неопределено, Настройки = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Настройки", Настройки);
	
	ОткрытьФорму("ВнешняяОбработка." + ИдентификаторПлагина + ".Форма.Настройки", ПараметрыФормы, ВладелецФормы, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ИдентификаторПлагина = ОбработкаОбъект.Метаданные().Имя;
	
КонецПроцедуры
