
&НаКлиенте
Процедура ВыполнитьПечать(Команда)
	//МассивОбъектов = Новый Массив;
	//МассивОбъектов.Добавить(Объект.СсылкаНаОбъект);    
	СсылкаДляПередачи = Объект.СсылкаНаОбъект;
	ТабДок = ВыполнитьПечатьНаСервере(СсылкаДляПередачи);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ВыполнитьПечатьНаСервере(СсылкаДляПередачи)
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаДляПередачи);
	
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ПФ_MXL_Т185");
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	Отладка= Истина;
	//СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	ТабДок = ОбъектОбработка.СформироватьПечатнуюФормуТ185(МассивОбъектов, ОбъектыПечати, ПараметрыВывода,Неопределено, Отладка);
	Возврат ТабДок;
	//ОбъектОбработка.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, Истина);
КонецФункции
&НаКлиенте
Процедура ПоказатьТабДокНаКлиенте(ТабДок)
	ТабДок.Показать();
КонецПроцедуры

