
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьТД();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТД()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОИРПисьмоОЗадолженности.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОИРПисьмоОЗадолженности КАК ОИРПисьмоОЗадолженности";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Вложение = Новый ТаблицаЗначений; 
	Вложение.Колонки.Добавить("АдресВоВременномХранилище", Новый ОписаниеТипов("Строка"));
	Вложение.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТабДок = Новый ТабличныйДокумент;
		Документы.ОИРПисьмоОЗадолженности.Печать(ТабДок, ВыборкаДетальныеЗаписи.Ссылка);
		ПотокВПамяти = Новый ПотокВПамяти();
		ТабДок.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.XLSX);
		ДвоичныеДанные = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные(); 
		
		Для Каждого Стр Из ВыборкаДетальныеЗаписи.Ссылка.Клиенты Цикл
			Если Справочники.Контрагенты.НайтиПоНаименованию(Стр.Клиент.Наименование).ОбособленноеПодразделение = Ложь Тогда
				Контрагент = Стр.Клиент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ДобавВлож = Вложение.Добавить();
		ДобавВлож.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		ДобавВлож.Представление = "Отчет " + Контрагент + "от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ".xlsx";
	КонецЦикла;	   
	
	СписокВложений = ОбщегоНазначения.ТаблицаЗначенийВМассив(Вложение);
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Вложения", СписокВложений);
	ПараметрыПисьма.Вставить("Кому", "spec.it@satoms.ru");
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
	Исключение
	КонецПопытки;
КонецПроцедуры     




