
&НаКлиенте
Процедура Обработка30()
	Обработка = Новый Файл(КаталогВременныхФайлов() + "\" + Объект.мВерсия +".epf");
	Если Обработка.Существует() Тогда
		УдалитьФайлы(КаталогВременныхФайлов() + "\" + Объект.мВерсия + ".epf");		
	КонецЕсли;		

	ОбработкаДвоичныеДанные = ПолучитьМакет(Объект.мВерсия);
	ОбработкаДвоичныеДанные.Записать(КаталогВременныхФайлов() + "\" + Объект.мВерсия + ".epf");
    
	Попытка                    	
    	ОткрытьВнешнююОбработку(КаталогВременныхФайлов() + "\" + Объект.мВерсия + ".epf");	
	Исключение
		Инфо = ИнформацияОбОшибке();
		Сообщить("Не удалось загрузить внешнюю обработку для версии 3.0!");
		Сообщить(ОписаниеОшибки());
		Сообщить("Описание='" + Инфо.Описание + "'");
    	Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
    	Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
    	Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
     	Отказ = Истина;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(ИмяМакета)       
    возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);               
Конецфункции


&НаКлиенте
Процедура ОткрытьВнешнююОбработку(Путь)
    АдресХранилища = "";
	оповещение = Новый ОписаниеОповещения("ОбработатьФайл",ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение, АдресХранилища, Путь, Ложь, ЭтаФорма.УникальныйИдентификатор);           

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФайл(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	ИмяОбработки = ПодключитьВнешнююОбработку(Адрес);
	
	форма = ПолучитьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма");
	форма.Открыть();
	
КонецПроцедуры


&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
    Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь); 
КонецФункции 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	
	Если Объект.мВерсия= "ЗУП30" или Объект.мВерсия = "ЗКГУ30" или Объект.мВерсия = "КАМИН" или Объект.мВерсия = "БП30"
	Тогда
		Обработка30();
	Иначе 
		Окно(); 
	КонецЕсли; 	

	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Окно()
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение,"Данная конфигурация не входит в список поддерживаемых. Продолжить работу?", РежимДиалогаВопрос.ДаНет);
	Сообщить("Неверно заполнено обязательное поле");

	
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Обработка30();
    КонецЕсли;

КонецПроцедуры

