                        
&НаСервере
Процедура ПоказатьДанные() Экспорт
	
	СсылкаНаОбъект = Объект.СсылкаНаОбъект;
	
	дз = РеквизитФормыВЗначение("Результат");
	обрОбъект = РеквизитФормыВЗначение("Объект");
	обрОбъект.ПоказатьДанныеОбъекта(дз);
	
	элДЗ = Результат.ПолучитьЭлементы();
	элДЗ.Очистить();
	
	Для Каждого СтрокаУровень0 Из дз.Строки Цикл
		сдз = элДЗ.Добавить();
		ЗаполнитьЗначенияСвойств(сдз,СтрокаУровень0);
		элДЗ2 = сдз.ПолучитьЭлементы();
		
		Для Каждого СтрокаУровень1 Из СтрокаУровень0.Строки Цикл
				сдз = элДЗ2.Добавить();
				ЗаполнитьЗначенияСвойств(сдз,СтрокаУровень1);
				элДЗ3 = сдз.ПолучитьЭлементы();
				
				Для Каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
					сдз = элДЗ3.Добавить();
					ЗаполнитьЗначенияСвойств(сдз,СтрокаУровень2);
				КонецЦикла;
		КонецЦикла;
			
	КонецЦикла;
		
	Подробно = Истина;
	Элементы.РезультатСиноним.Видимость = Подробно;
	Элементы.РезультатКомментарий.Видимость = Подробно;
	Элементы.РезультатВозможныйТипЗначения.Видимость = Подробно;
	
	Элементы.РезультатОбъект1Изменить.Видимость = ЗначениеЗаполнено(СсылкаНаОбъект);
	Элементы.РезультатОбъект1.Видимость = ЗначениеЗаполнено(СсылкаНаОбъект);
	Элементы.РезультатОбъект1ТипЗначения.Видимость = ЗначениеЗаполнено(СсылкаНаОбъект) И Подробно;

	кн = Элементы.Провести;
	Если кн <> Неопределено Тогда
		чПрава = 1;
		Если чПрава = 1 ИЛИ чПрава = 2 Тогда
			Если ЗначениеЗаполнено (СсылкаНаОбъект) Тогда
				Если Найти (СсылкаНаОбъект.Метаданные().ПолноеИмя(), "Документ") = 1 Тогда
					Если Строка(СсылкаНаОбъект.Метаданные().Проведение) = "Разрешить" Тогда
						кн.Доступность = Истина;
					Иначе
						кн.Доступность = Ложь;
					КонецЕсли;
				Иначе
					кн.Доступность = Ложь;
				КонецЕсли;
				Иначе
					кн.Доступность = Ложь;
				КонецЕсли;
			Иначе
				кн.Доступность = Ложь;
			КонецЕсли;
		Иначе
			кн.Доступность = Ложь;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	элДЗ = Результат.ПолучитьЭлементы();
	
	Для Каждого Строка Из элДЗ Цикл
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Если Строка.ПолучитьЭлементы().Количество() > 0 Тогда
			Элементы.Результат.Развернуть(ИдентификаторСтроки, Истина);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаОбъектПриИзменении1(Элемент)
	СсылкаНаОбъект = Объект.СсылкаНаОбъект;
	Подробно = Истина;

	Если СсылкаНаОбъект = Неопределено Тогда
	Иначе
		ма = Новый Массив;
		ма.Добавить(ТипЗнч(СсылкаНаОбъект));
		от = Новый ОписаниеТипов(ма);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПоказатьДанные();
	КонецЕсли;
	
	РазвернутьДерево();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДействиеКоманда(КомандаИмя)
	Обработка = РеквизитФормыВЗначение("Объект");
	элРезультат = Результат.ПолучитьЭлементы();
	бЕстьОшибки = Не Обработка.ЗаписатьОбъекты(элРезультат, КомандаИмя);
	Если Не бЕстьОшибки Тогда
		ПоказатьДанные();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДействие(Команда) Экспорт
	ЗаписатьДействиеКоманда(Команда.Имя);
	
	РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеДокументыПриАктивизацииСтроки(Элемент)
	Если ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
	Объект.СсылкаНаОбъект = Элементы.ПодчиненныеДокументы.ТекущиеДанные.Документ;
	СсылкаНаОбъектПриИзменении1(Элемент);
	КонецЕсли;
КонецПроцедуры



