&НаСервере
Перем КэшМодуляОбъекта;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта = Неопределено Тогда
		КэшМодуляОбъекта = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаСервере
Функция ИмяОбработкиНаСервере()
	
	Возврат МодульОбъекта().Метаданные().ПолноеИмя();
	
КонецФункции

&НаКлиенте
Процедура ОткрытьНастройки() Экспорт
	
	ИмяОткрываемойФормы = "Настройки";
	ПутьКФорме 			= ИмяОбработкиНаСервере() + ".Форма." + ИмяОткрываемойФормы;
		
	ОткрытьФорму(ПутьКФорме, , ВладелецФормы);
		
КонецПроцедуры