
&НаКлиенте
Процедура ОткрытьНастройки(ОписаниеОповещения = Неопределено, Настройки = Неопределено) Экспорт
	
	ИдентификаторПлагина = ИдентификаторПлагинанаСервере();
	// Так чуть медленнее, но не придется для каждого нового плагина менять. 
	// И открытие формы настроек - не критичная по скорости операция.
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Настройки", Настройки);
	
	ОткрытьФорму("ВнешняяОбработка." + ИдентификаторПлагина + ".Форма.Настройки", ПараметрыФормы, ВладелецФормы, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторПлагинанаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.Метаданные().Имя;
	
	Возврат Результат;
	
КонецФункции	