Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ПриемНаРаботу");          
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ОИР Трудовой договор");
	ПараметрыРегистрации.Вставить("Версия", "2.0");
	ПараметрыРегистрации.Вставить("Информация", " ");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.3.4.5");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	Команды = ТаблицаКоманд();
	ДобавитьКоманду(Команды, 
	"ОИР Трудовой договор",
	"СОГЛ",
	"ВызовСерверногоМетода",
	Истина,
	"ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", Команды);
	Возврат ПараметрыРегистрации; 
	
КонецФункции

Функция ТаблицаКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СОГЛ") Тогда
		СтруктураПараметровПечати = Новый Структура;
		СтруктураПараметровПечати.Вставить("ВидДокументаПечати",  "ПриемНаРаботу");
		СтруктураПараметровПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛ");
		СтруктураПараметровПечати.Вставить("ИмяМакетаПечати",     "СОГЛ");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СОГЛ", "ОИР Соглашение о КТ", 
		ПечатьСОГЛ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати),,);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСОГЛ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛ";
	Макет = ПолучитьМакет("СОГЛ");
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Преамбула = Макет.ПолучитьОбласть("Преамбула");
	ПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора");
	СрокДействияДоговора = Макет.ПолучитьОбласть("СрокДействияДоговора");
	ПраваОбязанности = Макет.ПолучитьОбласть("ПраваОбязанности");
	УсловияОплаты = Макет.ПолучитьОбласть("УсловияОплаты");
	РежимРабВремени = Макет.ПолучитьОбласть("РежимРабВремени");
	Гарантии = Макет.ПолучитьОбласть("Гарантии");
	Ответственность = Макет.ПолучитьОбласть("Ответственность");
	ОснованияРасторж = Макет.ПолучитьОбласть("ОснованияРасторж");
    Прочее = Макет.ПолучитьОбласть("Прочее");
	Реквизиты = Макет.ПолучитьОбласть("Реквизиты"); 
	//ЗапросИПеременные	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриемНаРаботу.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
	|	ПриемНаРаботу.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПриемНаРаботу.ФизическоеЛицо.ИНН КАК ФизическоеЛицоИНН,
	|	ПриемНаРаботу.ФизическоеЛицо.ДатаРождения КАК ФизическоеЛицоДатаРождения,
	|	ПриемНаРаботу.ФизическоеЛицо.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
	|	ПриемНаРаботу.ФизическоеЛицо.Фамилия КАК ФизическоеЛицоФамилия,
	|	ПриемНаРаботу.ФизическоеЛицо.Инициалы КАК ФизическоеЛицоИнициалы,
	|	ПриемНаРаботу.Организация.ОГРН КАК ОрганизацияОГРН,
	|	ПриемНаРаботу.Организация.ИНН КАК ОрганизацияИНН,
	|	ПриемНаРаботу.Организация.КПП КАК ОрганизацияКПП,
	|	ПриемНаРаботу.Организация КАК Организация,
	|	ПриемНаРаботу.Подразделение КАК Подразделение,
	|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	ПриемНаРаботу.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ПриемНаРаботу.Организация.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	|	ПриемНаРаботу.Руководитель КАК Руководитель,
	|	ПриемНаРаботу.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПриемНаРаботу.Должность КАК Должность,
	|	ПриемНаРаботу.ВидЗанятости КАК ВидЗанятости,
	|	ПриемНаРаботу.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер,
	|	ПриемНаРаботу.СовокупнаяТарифнаяСтавка КАК СовокупнаяТарифнаяСтавка
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В(&Массив)"; 
	Запрос.УстановитьПараметр("Массив", МассивОбъектов);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
	Заголовок.Параметры.ТрудовойДоговорДата = Формат(Выборка.ТрудовойДоговорДата,"ДФ=dd.MM.yyyy");
	Заголовок.Параметры.ТрудовойДоговорНомер = Выборка.ТрудовойДоговорНомер;
    ТабДокумент.Вывести(Заголовок);
	Преамбула.Параметры.ОрганизацияНаименованиеПолное = Выборка.ОрганизацияНаименованиеПолное;
	Преамбула.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
	МодульСклонениеПредставленийОбъектов = ОбщегоНазначения.ОбщийМодуль("СклонениеПредставленийОбъектов");
	Преамбула.Параметры.РуководительДолжностьВРП = МодульСклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьРуководителя, 2);
	Преамбула.Параметры.РуководительФИОПолныеВРП = МодульСклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Руководитель, 2);
	Если Строка(Выборка.ДолжностьРуководителя) = "Генеральный директор" Тогда
	Преамбула.Параметры.ОснованиеРуководителяВРП = "Устава";
	Иначе
	Преамбула.Параметры.ОснованиеРуководителяВРП = "Доверенности №_________";
	КонецЕсли;
	Преамбула.Параметры.ФИОСотрудникаПолные = Выборка.Сотрудник;
    ТабДокумент.Вывести(Преамбула);
	ПредметДоговора.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
	ПредметДоговора.Параметры.Подразделение = Выборка.Подразделение;
	ПредметДоговора.Параметры.НомерПодразделения = Выборка.Подразделение.НомерПодразделения;
	ПредметДоговора.Параметры.Должность = Выборка.Должность;
	ПредметДоговора.Параметры.ДолжностьВРП = МодульСклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Должность, 2);
	ПредметДоговора.Параметры.ВидЗанятостиПоДоговоруВТП = МодульСклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ВидЗанятости, 5);
    ТабДокумент.Вывести(ПредметДоговора);
	СрокДействияДоговора.Параметры.ТрудовойДоговорДата = Формат(Выборка.ТрудовойДоговорДата,"ДФ=dd.MM.yyyy");
	СрокДействияДоговора.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
    ТабДокумент.Вывести(СрокДействияДоговора);
    ТабДокумент.Вывести(ПраваОбязанности);
	УсловияОплаты.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	УсловияОплаты.Параметры.ОкладЦифрами = Выборка.СовокупнаяТарифнаяСтавка;
	УсловияОплаты.Параметры.ОкладБуквами = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Выборка.СовокупнаяТарифнаяСтавка,ВалютаРегламентированногоУчета); 
    ТабДокумент.Вывести(УсловияОплаты);
    ТабДокумент.Вывести(РежимРабВремени);
    ТабДокумент.Вывести(Гарантии);
    ТабДокумент.Вывести(Ответственность);
    ТабДокумент.Вывести(ОснованияРасторж);
	Прочее.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
    ТабДокумент.Вывести(Прочее);
	Реквизиты.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
	Реквизиты.Параметры.ОрганизацияИНН = Выборка.ОрганизацияИНН;
	Реквизиты.Параметры.ОрганизацияКПП = Выборка.ОрганизацияКПП;
	Реквизиты.Параметры.ОрганизацияОГРН = Выборка.ОрганизацияОГРН; 
		ТвойАдрис = "";
		Для Каждого Стр Из Выборка.Организация.КонтактнаяИнформация Цикл
			Если Стр.Вид.Наименование = "Юридический адрес" Тогда
				ТвойАдрис = Стр.Представление;
			КонецЕсли;
		КонецЦикла;
	Реквизиты.Параметры.АдресКомп = ТвойАдрис;
	Реквизиты.Параметры.ФИОСубъектаПолные = Выборка.ФизическоеЛицо;
	Реквизиты.Параметры.ДрСотр = Формат(Выборка.ФизическоеЛицоДатаРождения,"ДФ=dd.MM.yyyy");
	Реквизиты.Параметры.ИННСотр = Выборка.ФизическоеЛицоИНН;
	Реквизиты.Параметры.Снилс = Выборка.ФизическоеЛицоСтраховойНомерПФР;
		ТвойАдрес = "";
		Для Каждого Стр Из Выборка.ФизическоеЛицо.КонтактнаяИнформация Цикл
			Если Стр.Вид.Наименование = "Адрес по прописке" Тогда
				ТвойАдрес = Стр.Представление;
			КонецЕсли;
		КонецЦикла;	

	Реквизиты.Параметры.АдресСотр = ТвойАдрес;
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛиц.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Физлицо = &Физлицо
		|	И ДокументыФизическихЛиц.ВидДокумента = &ВидДокумента";
	Запрос.УстановитьПараметр("ФизЛицо", Выборка.ФизическоеЛицо); 
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("Паспорт гражданина РФ"));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Пас = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	Реквизиты.Параметры.Пас = Пас;
	Реквизиты.Параметры.ФИОСубъектаСокр = Выборка.ФизическоеЛицоФамилия + " " + Выборка.ФизическоеЛицоИнициалы;
	Реквизиты.Параметры.ТрудовойДоговорДата = Формат(Выборка.ТрудовойДоговорДата,"ДФ=dd.MM.yyyy");
	Реквизиты.Параметры.ФиоРук = Выборка.Руководитель.Фамилия + " " + Выборка.Руководитель.Инициалы; 
    ТабДокумент.Вывести(Реквизиты);
	КонецЦикла;	
	
	Возврат ТабДокумент; 
	
КонецФункции   




