Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Замена реквизитов");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", 2);
	//РегистрационныеДанные.Вставить("Вид", "ПечатнаяФорма");
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Информация", "Замена реквизитов");
	///////////// команды /////////////////////////
	
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "1";
	строкаКоманды.Представление = "Замена реквизитов";
	строкаКоманды.ПоказыватьОповещение = Истина;
	//строкаКоманды.Использование = "ВызовКлиентскогоМетода"; 
	строкаКоманды.Использование = "ОткрытиеФормы";
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;
КонецФункции

Процедура ОбновитьРеквизиты(Ветка, аОбъект, чИнд, сТаблЧасть = "") Экспорт
	
	р = Неопределено;
	Для каждого сдз Из Ветка Цикл
		Если сдз.ПолучитьЭлементы().Количество() > 0 Тогда
			элДЗ1 = сдз.ПолучитьЭлементы();
			
			Если сТаблЧасть = "" Тогда
				Пробел = Найти(сдз.Реквизит," ");
				Если Пробел<>0 Тогда
					ТаблЧасть= Лев(сдз.Реквизит,Пробел-1);
				КонецЕсли;
			Иначе
				ТаблЧасть = сТаблЧасть;
			КонецЕсли;
			
			ОбновитьРеквизиты(элДЗ1, аОбъект, чИнд, ТаблЧасть);
			Продолжить;
			
		КонецЕсли;
		
		ИзменитьОбъект = "Объект" +чИнд+"Изменить";
		Если сдз[ИзменитьОбъект] Тогда
			Если сТаблЧасть = "" Тогда
				Если сдз[ИзменитьОбъект] Тогда
					аОбъект[сдз.Реквизит] = сдз["Объект"+чИнд];
				Иначе
					сдз["Объект"+чИнд] = аОбъект[сдз.Реквизит];
				КонецЕсли;
			Иначе
				чНомерСтроки = Число(сдз.ПолучитьРодителя().Реквизит);
				сИмяТЧ = сТаблЧасть;
				Если сдз[ИзменитьОбъект] Тогда
					аОбъект[сИмяТЧ][чНомерСтроки-1][сдз.Реквизит] = сдз["Объект"+чИнд];
				Иначе
					сдз["Объект"+чИнд] = аОбъект[сИмяТЧ][чНомерСтроки-1][сдз.Реквизит];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура УбратьГалочки(Ветка, чИнд)
	Для каждого сдз Из Ветка Цикл
		Если сдз.ПолучитьЭлементы().Количество() > 0 Тогда
			сдз1 = сдз.ПолучитьЭлементы();
			УбратьГалочки(сдз1, чИнд);
		КонецЕсли;
		сдз["Объект"+чИнд+"Изменить"] = Ложь;
	КонецЦикла;
КонецПроцедуры

Функция ЗаписатьОбъекты(дзРезультат, сРежимЗаписи) Экспорт
	всеОК = Истина;
	
	
	Для чИнд = 1 По 1 Цикл
		Если чИнд = 1 Тогда
			аСсылка = СсылкаНаОбъект;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(аСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		аОбъект = аСсылка.ПолучитьОбъект();
		ОбновитьРеквизиты(дзРезультат, аОбъект, чИнд);
		
		бЗагрузка = аОбъект.ОбменДанными.Загрузка;
		
		Если сРежимЗаписи = "ЗаписатьОДЗ" Тогда
			аОбъект.ОбменДанными.Загрузка = Истина;
		КонецЕсли;
		
		Попытка
			Если Найти(ВРег(аОбъект.Метаданные().ПолноеИмя()), "ДОКУМЕНТ") = 1 Тогда
				Если сРежимЗаписи = "Провести" Тогда
					аОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Иначе
					аОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			Иначе
				аОбъект.Записать();
			КонецЕсли;
			УбратьГалочки(дзРезультат, чИнд);
		Исключение
			Сообщить("Не удалось записать объект " + чИнд + ":
			|" + аСсылка + "
			|" + ОписаниеОшибки());
			всеОК = Ложь;
		КонецПопытки;
		
		аОбъект.ОбменДанными.Загрузка = бЗагрузка;
	КонецЦикла;
	
	Возврат всеОК;
	
КонецФункции

Функция ПодготовитьВывод(рез)
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат "Не указан ни один из объектов";
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
	КонецЕсли;
	
	рез = Новый ДеревоЗначений;
	рез.Колонки.Добавить("Реквизит", онОписаниеТипа("Строка"));
	
	рез.Колонки.Добавить("Синоним");
	рез.Колонки.Добавить("Комментарий");
	рез.Колонки.Добавить("ВозможныйТипЗначения");
	
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		рез.Колонки.Добавить("Объект1Изменить", онОписаниеТипа("Булево"));
		рез.Колонки.Добавить("Объект1");
	КонецЕсли;
	
	
	Возврат "";
КонецФункции

Функция онОписаниеТипа(НазваниеТипа, Парам1 = Неопределено, Парам2 = 0) Экспорт
	Масс = Новый Массив;
	Масс.Добавить(Тип(НазваниеТипа));
	Если НазваниеТипа = "Строка" Тогда
		Если Парам1 <> Неопределено Тогда
			КвалифСтроки = Новый КвалификаторыСтроки(Парам1, ДопустимаяДлина.Переменная);
		Иначе
			КвалифСтроки = Новый КвалификаторыСтроки(0);
		КонецЕсли;
	ИначеЕсли НазваниеТипа = "Число" Тогда
		КвалифЧисла = Новый КвалификаторыЧисла(Парам1, Парам2, ДопустимыйЗнак.Любой);
	ИначеЕсли НазваниеТипа = "Дата" Тогда
		Если Парам1 = Неопределено Тогда
			КвалифДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		Иначе
			КвалифДаты = Новый КвалификаторыДаты(Парам1);
		КонецЕсли; 
	КонецЕсли;
	Возврат Новый ОписаниеТипов(Масс, КвалифСтроки, КвалифЧисла, КвалифДаты);
КонецФункции

Функция тзДобавить(тз, сИмя, сИД = "1")
	стз = тз.Добавить();
	стз.Имя = сИмя;
	стз.ИД = сИД;
КонецФункции

Процедура ВывестиРеквизиты(ВсеСдз, ИмяТЧ = "", чНомСтр = 0)
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		аСсылка = СсылкаНаОбъект;
	КонецЕсли;
	
	тзРеквизиты = Новый ТаблицаЗначений;
	тзРеквизиты.Колонки.Добавить("Имя",онОписаниеТипа("Строка"));
	тзРеквизиты.Колонки.Добавить("ИД",онОписаниеТипа("Строка"));
	Если ИмяТЧ = "" Тогда
		тзДобавить(тзРеквизиты, "Метаданные().ПолноеИмя()");
		тзДобавить(тзРеквизиты, "УникальныйИдентификатор()");
		
		сПИмя = аСсылка.Метаданные().ПолноеИмя();
		Если Найти(сПИмя, "Справочник.") = 1 Тогда
			тзДобавить(тзРеквизиты, "ПолучитьИмяПредопределенного()", "1");
			тзДобавить(тзРеквизиты, "ВерсияДанных", "2");
			тзДобавить(тзРеквизиты, "Код", "3");
			тзДобавить(тзРеквизиты, "Наименование", "3");
			Если аСсылка.Метаданные().Владельцы.Количество() > 0 Тогда
				тзДобавить(тзРеквизиты, "Владелец", "3");
			КонецЕсли;
			Если аСсылка.Метаданные().Иерархический Тогда
				тзДобавить(тзРеквизиты, "Родитель", "3");
			КонецЕсли;
		ИначеЕсли Найти(сПИмя, "Документ.") = 1 Тогда
			тзДобавить(тзРеквизиты, "Дата", "3");
			тзДобавить(тзРеквизиты, "ВерсияДанных", "2");
			тзДобавить(тзРеквизиты, "Номер", "3");
			тзДобавить(тзРеквизиты, "Проведен", "2");
		ИначеЕсли Найти(сПИмя, "ПланВидовХарактеристик.") = 1 Тогда
			тзДобавить(тзРеквизиты, "ПолучитьИмяПредопределенного()", "1");
			тзДобавить(тзРеквизиты, "ВерсияДанных", "2");
			тзДобавить(тзРеквизиты, "Код", "3");
			тзДобавить(тзРеквизиты, "Наименование", "3");
		ИначеЕсли Найти(сПИмя, "ПланСчетов.") = 1 Тогда
			тзДобавить(тзРеквизиты, "ПолучитьИмяПредопределенного()", "1");
			тзДобавить(тзРеквизиты, "ВерсияДанных", "2");
			тзДобавить(тзРеквизиты, "Код", "3");
			тзДобавить(тзРеквизиты, "Наименование", "3");
		ИначеЕсли Найти(сПИмя, "ПланВидовРасчета.") = 1 Тогда
			тзДобавить(тзРеквизиты, "ПолучитьИмяПредопределенного()", "1");
			тзДобавить(тзРеквизиты, "ВерсияДанных", "2");
			тзДобавить(тзРеквизиты, "Код", "3");
			тзДобавить(тзРеквизиты, "Наименование", "3");
		КонецЕсли;
		
		тзДобавить(тзРеквизиты, "ПометкаУдаления", "2");
	КонецЕсли;	
	
	Если ИмяТЧ = "" Тогда
		аРеквизиты = аСсылка.Метаданные().Реквизиты;
	Иначе
		аРеквизиты = аСсылка.Метаданные().ТабличныеЧасти[ИмяТЧ].Реквизиты;
	КонецЕсли;
	
	Для каждого рекв Из аРеквизиты Цикл
		тзДобавить(тзРеквизиты, рекв.Имя, "4");
	КонецЦикла;
	
	Для каждого стзРеквизиты ИЗ тзРеквизиты Цикл
		
		сИмя = стзРеквизиты.Имя;
		
		сдз = ВсеСдз.Добавить();
		сдз.Реквизит = сИмя;
		Если стзРеквизиты.ИД = "1" Тогда
			Если сИмя = "УникальныйИдентификатор()" Тогда
				Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
					сдз.Объект1 = Строка(СсылкаНаОбъект.УникальныйИдентификатор());
				КонецЕсли;
			ИначеЕсли сИмя = "Метаданные().ПолноеИмя()" Тогда
				Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
					сдз.Объект1 = Строка(СсылкаНаОбъект.Метаданные().ПолноеИмя());
				КонецЕсли;
			ИначеЕсли сИмя = "ПолучитьИмяПредопределенного()" Тогда
				Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
					сМИмя = СсылкаНаОбъект.Метаданные().Имя;
					сПИмя = СсылкаНаОбъект.Метаданные().ПолноеИмя();
					Если Найти (сПИмя, "Справочник.") = 1 Тогда
						сдз.Объект1 = Строка(Справочники[сМИмя].ПолучитьИмяПредопределенного(СсылкаНаОбъект));
					ИначеЕсли Найти (сПИмя, "ПланВидовХарактеристик.") = 1 Тогда
						сдз.Объект1 = Строка(ПланыВидовХарактеристик[сМИмя].ПолучитьИмяПредопределенного(СсылкаНаОбъект));
					ИначеЕсли Найти (сПИмя, "ПланСчетов.") = 1 Тогда
						сдз.Объект1 = Строка(ПланыСчетов[сМИмя].ПолучитьИмяПредопределенного(СсылкаНаОбъект));
					ИначеЕсли Найти (сПИмя, "ПланВидовРасчета.") = 1 Тогда
						сдз.Объект1 = Строка(ПланыВидовРасчета[сМИмя].ПолучитьИмяПредопределенного(СсылкаНаОбъект));
					Иначе
						сдз.Объект1 = Неопределено;
					КонецЕсли;
				КонецЕсли;
			Иначе
			КонецЕсли;
		Иначе
			Если стзРеквизиты.ИД = "4" Тогда
				сдз.Синоним = аРеквизиты[сИмя].Синоним;
				сдз.Комментарий = аРеквизиты[сИмя].Комментарий;
				сдз.ВозможныйТипЗначения = аРеквизиты[сИмя].Тип;
				Если аРеквизиты[сИмя].Тип.Типы().Количество() = 1 Тогда
					Если аРеквизиты[сИмя].Тип.Типы()[0] = Тип("ХранилищеЗначения") Тогда
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
				Если ИмяТЧ = "" Тогда
					сдз.Объект1 = СсылкаНаОбъект[стзРеквизиты.Имя];
					ма = Новый Массив;
					ма.Добавить(ТипЗнч(СсылкаНаОбъект[стзРеквизиты.Имя]));
				Иначе
					Если чНомСтр <= СсылкаНаОбъект[ИмяТЧ].Количество() Тогда
						сдз.Объект1 = СсылкаНаОбъект[ИмяТЧ][чНомСтр-1][стзРеквизиты.Имя];
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПоказатьДанныеОбъекта(дз) Экспорт
	
	Рез = Новый ДеревоЗначений;
	сОшибки = ПодготовитьВывод(Рез);
	Если сОшибки <> "" Тогда
		Сообщить(сОшибки);
		Возврат;
	КонецЕсли;
	
	ВывестиРеквизиты(Рез.Строки, "");
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		аСсылка = СсылкаНаОбъект;
	КонецЕсли;
	
	Для каждого тч Из аСсылка.Метаданные().ТабличныеЧасти Цикл
		сдз = рез.Строки.Добавить();
		сдз.Реквизит = тч.Имя + " (табл. часть)";
		сдз.Синоним = тч.Синоним;
		сдз.Комментарий = тч.Комментарий;
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			чКолво1 = СсылкаНаОбъект[тч.Имя].Количество();
		Иначе
			чКолво1 = 0;
		КонецЕсли;		
		чКолво = Макс(чКолво1);
		Для чНомСтр = 1 По чКолво Цикл
			сдз1 = сдз.Строки.Добавить();
			сдз1.Реквизит = Формат(чНомСтр, "ЧГ=0");
			ВывестиРеквизиты(сдз1.Строки, тч.Имя, чНомСтр);
		КонецЦикла;
	КонецЦикла;
	
	дз = Рез;
КонецПроцедуры


Функция ПроверитьПрава() Экспорт
	сПользователь = ВРег(ИмяПользователя());
	Если сПользователь = "" Тогда
		Возврат 1;
	КонецЕсли;
	
	макетПрава = ПолучитьМакет("Пользователи");
	чИнд = 2;
	сПраваПользователь = ВРег(СокрЛП(макетПрава.Область(чИнд,1).Текст));
	Пока сПраваПользователь <> "" Цикл
		Если сПраваПользователь = сПользователь Тогда
			Если СокрЛП(макетПрава.Область(чИнд,2).Текст) = "1" Тогда
				Возврат 1;
			ИначеЕсли СокрЛП(макетПрава.Область(чИнд,3).Текст) = "1" Тогда
				Возврат 2;
			ИначеЕсли СокрЛП(макетПрава.Область(чИнд,4).Текст) = "1" Тогда
				Возврат 3;
			КонецЕсли;
			
			Возврат 0;
		Иначе
			чИнд = чИнд + 1;
			сПраваПользователь = ВРег(СокрЛП(макетПрава.Область(чИнд,1).Текст));
		КонецЕсли;
	КонецЦикла;
	
	Если чИнд > 2 Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

