Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.СогласиеНаОбработкуПерсональныхДанных");          
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ОИР Согласие на обработку персональных данных");
	ПараметрыРегистрации.Вставить("Версия", "2.0");
	ПараметрыРегистрации.Вставить("Информация", " ");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.3.4.5");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	Команды = ТаблицаКоманд();
	ДобавитьКоманду(Команды, 
	"ОИР Согласие на обработку персональных данных",
	"СОГЛ",
	"ВызовСерверногоМетода",
	Истина,
	"ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", Команды);
	Возврат ПараметрыРегистрации; 
	
КонецФункции

Функция ТаблицаКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СОГЛ") Тогда
		СтруктураПараметровПечати = Новый Структура;
		СтруктураПараметровПечати.Вставить("ВидДокументаПечати",  "СогласиеНаОбработкуПерсональныхДанных");
		СтруктураПараметровПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛ");
		СтруктураПараметровПечати.Вставить("ИмяМакетаПечати",     "СОГЛ");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СОГЛ", "ОИР Согласие на обработку персональных данных", 
		ПечатьСОГЛ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати),,);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСОГЛ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛ";
	Макет = ПолучитьМакет("СОГЛ");
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	НомерДата = Макет.ПолучитьОбласть("НомерДата");
	Преамбула = Макет.ПолучитьОбласть("Преамбула");
	П1 = Макет.ПолучитьОбласть("П1_ЦелиОбработкиПДн");
	П2 = Макет.ПолучитьОбласть("П2_СоставПДн");
	П3 = Макет.ПолучитьОбласть("П3_ДействияСПДн");
	П4 = Макет.ПолучитьОбласть("П4_ПравоПолученияИнформации");
	П5 = Макет.ПолучитьОбласть("П5_СрокДействия");
	П6 = Макет.ПолучитьОбласть("П6_ПравоОтзыва"); 
	РеквизитыОператора = Макет.ПолучитьОбласть("РеквизитыОператора"); 
	РеквизитыСубъекта = Макет.ПолучитьОбласть("РеквизитыСубъекта"); 
	
	//ЗапросИПеременные	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СогласиеНаОбработкуПерсональныхДанных.Ссылка КАК Ссылка,
	|	СогласиеНаОбработкуПерсональныхДанных.ВерсияДанных КАК ВерсияДанных,
	|	СогласиеНаОбработкуПерсональныхДанных.ПометкаУдаления КАК ПометкаУдаления,
	|	СогласиеНаОбработкуПерсональныхДанных.Номер КАК Номер,
	|	СогласиеНаОбработкуПерсональныхДанных.Дата КАК Дата,
	|	СогласиеНаОбработкуПерсональныхДанных.Проведен КАК Проведен,
	|	СогласиеНаОбработкуПерсональныхДанных.Организация КАК Организация,
	|	СогласиеНаОбработкуПерсональныхДанных.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	СогласиеНаОбработкуПерсональныхДанных.ЮридическийАдресОрганизации КАК ЮридическийАдресОрганизации,
	|	СогласиеНаОбработкуПерсональныхДанных.ОтветственныйЗаОбработкуПерсональныхДанных КАК ОтветственныйЗаОбработкуПерсональныхДанных,
	|	СогласиеНаОбработкуПерсональныхДанных.ФИООтветственногоЗаОбработкуПДн КАК ФИООтветственногоЗаОбработкуПДн,
	|	СогласиеНаОбработкуПерсональныхДанных.Субъект КАК Субъект,
	|	СогласиеНаОбработкуПерсональныхДанных.ФИОСубъекта КАК ФИОСубъекта,
	|	СогласиеНаОбработкуПерсональныхДанных.АдресСубъекта КАК АдресСубъекта,
	|	СогласиеНаОбработкуПерсональныхДанных.ПаспортныеДанные КАК ПаспортныеДанные,
	|	СогласиеНаОбработкуПерсональныхДанных.ДатаПолучения КАК ДатаПолучения,
	|	СогласиеНаОбработкуПерсональныхДанных.СрокДействия КАК СрокДействия,
	|	СогласиеНаОбработкуПерсональныхДанных.Ответственный КАК Ответственный,
	|	СогласиеНаОбработкуПерсональныхДанных.Комментарий КАК Комментарий,
	|	СогласиеНаОбработкуПерсональныхДанных.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты
	|ИЗ
	|	Документ.СогласиеНаОбработкуПерсональныхДанных КАК СогласиеНаОбработкуПерсональныхДанных
	|ГДЕ
	|	СогласиеНаОбработкуПерсональныхДанных.Ссылка В(&Массив)"; 
	
	Запрос.УстановитьПараметр("Массив", МассивОбъектов);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТабДокумент.Вывести(Заголовок);
	НомерДата.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(НомерДата);
	Преамбула.Параметры.ФИОСубъекта = Выборка.ФИОСубъекта;
	Преамбула.Параметры.ИНН = Выборка.Организация.ИНН;
	Преамбула.Параметры.ОГРН = Выборка.Организация.ОГРН;
	Преамбула.Параметры.НаименованиеСокращенное = Выборка.Организация.НаименованиеСокращенное;
	МодульСклонениеПредставленийОбъектов = ОбщегоНазначения.ОбщийМодуль("СклонениеПредставленийОбъектов");
	Преамбула.Параметры.ОрганизацияВДательномПадеже = МодульСклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Организация.НаименованиеПолное, 3);
	ТабДокумент.Вывести(Преамбула);
	ТабДокумент.Вывести(П1);
	П2.Параметры.НаименованиеСокращенное = Выборка.Организация.НаименованиеСокращенное;
	ТабДокумент.Вывести(П2);
	ТабДокумент.Вывести(П3);
	ТабДокумент.Вывести(П4);
	П5.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
	Если Строка(Выборка.СрокДействия) = "01.01.0001 0:00:00" Тогда
	П5.Параметры.СрокДействия = "бессрочно";
	Иначе
	П5.Параметры.СрокДействия = "по " + Формат(Выборка.СрокДействия, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	ТабДокумент.Вывести(П5);
	ТабДокумент.Вывести(П6);
	РеквизитыОператора.Параметры.Полное = Выборка.Организация.НаименованиеПолное;
	РеквизитыОператора.Параметры.Сокращённое = Выборка.Организация.НаименованиеСокращенное;
	РеквизитыОператора.Параметры.АдресОператора = Выборка.ЮридическийАдресОрганизации;
	ББ = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Справочники.Сотрудники.НайтиПоНаименованию(Выборка.Ответственный),"Должность", ТекущаяДата());
	РеквизитыОператора.Параметры.ДолжностьКадр = ББ.Должность;
	РеквизитыОператора.Параметры.ФИОКадр = Выборка.Ответственный;
	ТабДокумент.Вывести(РеквизитыОператора); 
	РеквизитыСубъекта.Параметры.ФИО = Выборка.ФИОСубъекта;
	РеквизитыСубъекта.Параметры.АдресСуб = Выборка.АдресСубъекта;
	РеквизитыСубъекта.Параметры.ПаспортСуб = Выборка.ПаспортныеДанные;
	ТабДокумент.Вывести(РеквизитыСубъекта);
	
	Возврат ТабДокумент; 
	КонецЦикла;
КонецФункции   

