
Функция СведенияОВнешнейОбработке() Экспорт
	
	Ид = "ПроверкаСлужебныхЗаписок";
	Наименование = "ПроверкаСлужебныхЗаписок";
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименование = Наименование;
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = Наименование;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Проверка служебных записок";
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.Идентификатор = "ПроверкаСлужебныхЗаписок";
	
	Возврат ПараметрыРегистрации
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ПроверкаСлужебныхЗаписок" Тогда
		
		ПроверкаСлужебнойЗаписки();
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверкаСлужебнойЗаписки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СлужебнаяЗапискаНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СлужебнаяЗапискаНаТовары КАК СлужебнаяЗапискаНаТовары
	|ГДЕ
	|	СлужебнаяЗапискаНаТовары.Проведен
	|	И СлужебнаяЗапискаНаТовары.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыСлужебнойЗаписки.НаСогласовании)";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.СогласованВ1СДокументооборот(ВыборкаДетальныеЗаписи.Ссылка) = Истина Тогда 
			ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокОбъект.Состояние = Перечисления.СтатусыСлужебнойЗаписки.Согласован;
			ДокОбъект.ДатаСогласования = ТекущаяДатаСеанса(); 
			Попытка
				ДокОбъект.Записать();   
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;  
КонецПроцедуры	