Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Справочник.Сотрудники");          
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ОИР Соглашение на фото");
	ПараметрыРегистрации.Вставить("Версия", "2.0");
	ПараметрыРегистрации.Вставить("Информация", " ");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.3.4.5");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	Команды = ТаблицаКоманд();
	ДобавитьКоманду(Команды, 
	"ОИР Соглашение на фото",
	"СОГЛАШЕНИЕ",
	"ВызовСерверногоМетода",
	Истина,
	"ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", Команды);
	Возврат ПараметрыРегистрации; 
	
КонецФункции

Функция ТаблицаКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СОГЛАШЕНИЕ") Тогда
		СтруктураПараметровПечати = Новый Структура;
		СтруктураПараметровПечати.Вставить("ВидСправочникаПечати",  "Сотрудники");
		СтруктураПараметровПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛАШЕНИЕАШЕНИЕ");
		СтруктураПараметровПечати.Вставить("ИмяМакетаПечати",     "СОГЛАШЕНИЕ");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СОГЛАШЕНИЕ", "ОИР Соглашение на фото", 
		ПечатьСОГЛАШЕНИЕ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати),,);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСОГЛАШЕНИЕ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛАШЕНИЕАШЕНИЕ";
	Макет = ПолучитьМакет("СОГЛАШЕНИЕ");
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Преамбула = Макет.ПолучитьОбласть("Преамбула");
	ПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора");
	Реквизиты = Макет.ПолучитьОбласть("Реквизиты"); 
	//ЗапросИПеременные	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Массив)"; 
	Запрос.УстановитьПараметр("Массив", МассивОбъектов);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		ТабДокумент.Вывести(Заголовок); 
		ТабДокумент.Вывести(Преамбула);
		
		ПредметДоговора.Параметры.ФИО = Выборка.ФизическоеЛицо.ФИО;
		
		ЗапросПас = Новый Запрос;
		ЗапросПас.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛиц.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Физлицо = &Физлицо
		|	И ДокументыФизическихЛиц.ВидДокумента = &ВидДокумента";
		ЗапросПас.УстановитьПараметр("ФизЛицо", Выборка.ФизическоеЛицо); 
		ЗапросПас.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("Паспорт гражданина РФ"));
		РезультатЗапроса = ЗапросПас.Выполнить();
		ВыборПас = РезультатЗапроса.Выбрать();
		Пока ВыборПас.Следующий() Цикл
			Пас = ВыборПас.Представление;
		КонецЦикла;
		ПредметДоговора.Параметры.Пас = Пас; 
		ТвойАдрес = "";
		Для Каждого Стр Из Выборка.ФизическоеЛицо.КонтактнаяИнформация Цикл
			Если Стр.Вид.Наименование = "Адрес по прописке" Тогда
				ТвойАдрес = Стр.Представление;
			КонецЕсли;
		КонецЦикла;	
		ПредметДоговора.Параметры.АдРег = ТвойАдрес;
		ТабДокумент.Вывести(ПредметДоговора);
				
		Реквизиты.Параметры.Сотрудник = Выборка.ФизическоеЛицо.ФИО; 
		Реквизиты.Параметры.ТекДата = Формат(ТекущаяДатаСеанса(),"ДФ=dd.MM.yyyy"); 
		ТабДокумент.Вывести(Реквизиты);
	КонецЦикла;	
	
	Возврат ТабДокумент; 
	
	
	
	
КонецФункции   




