Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ПриемНаРаботу");          
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ОИР Соглашение о КТ");
	ПараметрыРегистрации.Вставить("Версия", "2.0");
	ПараметрыРегистрации.Вставить("Информация", " ");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.3.4.5");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	Команды = ТаблицаКоманд();
	ДобавитьКоманду(Команды, 
	"ОИР Соглашение о КТ",
	"СОГЛ",
	"ВызовСерверногоМетода",
	Истина,
	"ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", Команды);
	Возврат ПараметрыРегистрации; 
	
КонецФункции

Функция ТаблицаКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СОГЛ") Тогда
		СтруктураПараметровПечати = Новый Структура;
		СтруктураПараметровПечати.Вставить("ВидДокументаПечати",  "ПриемНаРаботу");
		СтруктураПараметровПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛ");
		СтруктураПараметровПечати.Вставить("ИмяМакетаПечати",     "СОГЛ");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СОГЛ", "ОИР Соглашение о КТ", 
		ПечатьСОГЛ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати),,);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСОГЛ(МассивОбъектов, ОбъектыПечати, СтруктураПараметровПечати)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СОГЛ";
	Макет = ПолучитьМакет("СОГЛ");
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	НомерДата = Макет.ПолучитьОбласть("НомерДата");
	Преамбула = Макет.ПолучитьОбласть("Преамбула");
	П1 = Макет.ПолучитьОбласть("П1_1");
	П12 = Макет.ПолучитьОбласть("П1_2_1");
	П122 = Макет.ПолучитьОбласть("П1_2_2");
	П123 = Макет.ПолучитьОбласть("П1_2_3");
	П124 = Макет.ПолучитьОбласть("П1_2_4");
	П125 = Макет.ПолучитьОбласть("П1_2_5");
	П126 = Макет.ПолучитьОбласть("П1_2_6");
	П127 = Макет.ПолучитьОбласть("П1_2_7");
    П128 = Макет.ПолучитьОбласть("П1_2_8");
	П129 = Макет.ПолучитьОбласть("П1_2_9");
	П1210 = Макет.ПолучитьОбласть("П1_2_10");
	П1211 = Макет.ПолучитьОбласть("П1_2_11");
	П1212 = Макет.ПолучитьОбласть("П1_2_12");
	П13 = Макет.ПолучитьОбласть("П1_3");
	П14 = Макет.ПолучитьОбласть("П1_4");
	П2 = Макет.ПолучитьОбласть("П2");
	П3 = Макет.ПолучитьОбласть("П3");
    П4 = Макет.ПолучитьОбласть("П4");
	Реквизиты = Макет.ПолучитьОбласть("Реквизиты");  
	//ЗапросИПеременные	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриемНаРаботу.Ссылка КАК Ссылка,
	|	ПриемНаРаботу.Дата КАК Дата,
	|	ПриемНаРаботу.Организация КАК Организация,
	|	ПриемНаРаботу.Подразделение КАК Подразделение,
	|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	ПриемНаРаботу.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПриемНаРаботу.Должность КАК Должность,
	|	ПриемНаРаботу.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	ПриемНаРаботу.ДатаПриема КАК ДатаПриема,
	|	ПриемНаРаботу.КоличествоСтавок КАК КоличествоСтавок,
	|	ПриемНаРаботу.ВидЗанятости КАК ВидЗанятости,
	|	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
	|	ПриемНаРаботу.ГрафикРаботы КАК ГрафикРаботы,
	|	ПриемНаРаботу.СпособРасчетаАванса КАК СпособРасчетаАванса,
	|	ПриемНаРаботу.Аванс КАК Аванс,
	|	ПриемНаРаботу.УсловияПриема КАК УсловияПриема,
	|	ПриемНаРаботу.Руководитель КАК Руководитель,
	|	ПриемНаРаботу.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПриемНаРаботу.Ответственный КАК Ответственный,
	|	ПриемНаРаботу.Организация.КПП КАК ОрганизацияКПП,
	|	ПриемНаРаботу.Организация.ИНН КАК ОрганизацияИНН,
	|	ПриемНаРаботу.Организация.ОГРН КАК ОрганизацияОГРН,
	|	ПриемНаРаботу.Организация.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	|	ПриемНаРаботу.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ПриемНаРаботу.ФизическоеЛицо.ИНН КАК ФизическоеЛицоИНН,
	|	ПриемНаРаботу.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер,
	|	ПриемНаРаботу.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
	|	ПриемНаРаботу.ФизическоеЛицо.ИНН КАК ФизическоеЛицоИНН1,
	|	ПриемНаРаботу.ФизическоеЛицо.ДатаРождения КАК ФизическоеЛицоДатаРождения
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В(&Массив)"; 
	Запрос.УстановитьПараметр("Массив", МассивОбъектов);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(); 
	Пока Выборка.Следующий() Цикл
	Заголовок.Параметры.ТрудовойДоговорДата = Формат(Выборка.ТрудовойДоговорДата, "ДФ=dd.MM.yyyy");
	Заголовок.Параметры.ТрудовойДоговорНомер = Выборка.ТрудовойДоговорНомер;
    ТабДокумент.Вывести(Заголовок);
	НомерДата.Параметры.Дата = Формат(Выборка.ДатаПриема, "ДФ=dd.MM.yyyy");
    ТабДокумент.Вывести(НомерДата);
	Преамбула.Параметры.ОрганизацияНаименованиеПолное = Выборка.ОрганизацияНаименованиеПолное;
	Преамбула.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
	МодульСклонениеПредставленийОбъектов = ОбщегоНазначения.ОбщийМодуль("СклонениеПредставленийОбъектов");
	Преамбула.Параметры.РуководительФИОПолныеВРП = МодульСклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Руководитель, 2);
	Преамбула.Параметры.РуководительДолжностьВРП = МодульСклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьРуководителя, 2);
	Если Строка(Выборка.ДолжностьРуководителя) = "Генеральный директор" Тогда 
	Преамбула.Параметры.ОснованиеРуководителяВРП = "Устава";
	Иначе
	Преамбула.Параметры.ОснованиеРуководителяВРП = "Доверенности № ______";
	КонецЕсли;
	Преамбула.Параметры.ФИОСотрудникаПолные = Выборка.Сотрудник;
    ТабДокумент.Вывести(Преамбула);
    ТабДокумент.Вывести(П1);
    ТабДокумент.Вывести(П12);
    ТабДокумент.Вывести(П122);
    ТабДокумент.Вывести(П123);
    ТабДокумент.Вывести(П124);
    ТабДокумент.Вывести(П125);
    ТабДокумент.Вывести(П126);
    ТабДокумент.Вывести(П127);
    ТабДокумент.Вывести(П128);
    ТабДокумент.Вывести(П129);
    ТабДокумент.Вывести(П1210);
    ТабДокумент.Вывести(П1211);
    ТабДокумент.Вывести(П1212);
    ТабДокумент.Вывести(П13);
    ТабДокумент.Вывести(П14);
    ТабДокумент.Вывести(П2);
    ТабДокумент.Вывести(П3);
    ТабДокумент.Вывести(П4); 
	Реквизиты.Параметры.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
	Реквизиты.Параметры.ОрганизацияИНН = Выборка.ОрганизацияИНН;
	Реквизиты.Параметры.ОрганизацияКПП = Выборка.ОрганизацияКПП;
	Реквизиты.Параметры.ОрганизацияОГРН = Выборка.ОрганизацияОГРН;
	ТвойАдрис = "";
		Для Каждого Стр Из Выборка.Организация.КонтактнаяИнформация Цикл
			Если Стр.Вид.Наименование = "Юридический адрес" Тогда
				ТвойАдрис = Стр.Представление;
			КонецЕсли;
		КонецЦикла;
	Реквизиты.Параметры.АдресРаботодателя = ТвойАдрис;
	Реквизиты.Параметры.Директор = Выборка.Руководитель.Фамилия + " " + Выборка.Руководитель.Инициалы;
	Реквизиты.Параметры.ФИОСубъектаПолные = Выборка.Сотрудник;
	Реквизиты.Параметры.ДРСотр = Формат(Выборка.ФизическоеЛицоДатаРождения,"ДФ=dd.MM.yyyy");
	Реквизиты.Параметры.ИНН = Выборка.ФизическоеЛицоИНН;
	Реквизиты.Параметры.Снилс = Выборка.ФизическоеЛицо.СтраховойНомерПФР;
	ТвойАдрес = "";
		Для Каждого Стр Из Выборка.ФизическоеЛицо.КонтактнаяИнформация Цикл
			Если Стр.Вид.Наименование = "Адрес по прописке" Тогда
				ТвойАдрес = Стр.Представление;
			КонецЕсли;
		КонецЦикла;	Реквизиты.Параметры.АдресСотр = ТвойАдрес;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛиц.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Физлицо = &Физлицо
		|	И ДокументыФизическихЛиц.ВидДокумента = &ВидДокумента";
	Запрос.УстановитьПараметр("ФизЛицо", Выборка.ФизическоеЛицо); 
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("Паспорт гражданина РФ"));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Пас = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	Реквизиты.Параметры.ПаспортныеДанные = Пас;
	Реквизиты.Параметры.ФИОСубъектаСокр = Выборка.ФизическоеЛицо.Фамилия + " " + Выборка.ФизическоеЛицо.Инициалы;
    ТабДокумент.Вывести(Реквизиты);
	КонецЦикла;	
	
	Возврат ТабДокумент; 
	
КонецФункции   




